#+STARTUP: hidestars
Land of Lisp Text Adventure

In this section of Land of Lisp, we are building a text adventure!

* *nodes* - An alist
First step is to create something called an "=alist=", that pretty
much is just a list containing lists withe the first element of each
list being the identifier to "fetch" information using... Pretty
similar to a hash map.

Also, we are using lists instead of strings for the descriptions so we
can work with descriptions in a particularly Lispy way, but this is
not required.

#+BEGIN_SRC lisp :tangle yes :exports code :padline no
(defparameter *nodes*
  '((living-room (you are in the living-room.
                  a wizard is snoring loudly on the couch.))
    (garden (you are in a beautiful garden.
             there is a well in front of you.))
    (attic (you are in the attic.
            there is a giant welding torch in the corner.))))
#+END_SRC

#+RESULTS:
: *NODES*

An =alist= can be fetched from using the Common Lisp =assoc= function.

So:
#+BEGIN_SRC lisp :exports both
(let ((pokemon
       '((favorite "Mawile")
         (old-favotire "Pichu"))))
  (assoc 'favorite pokemon))
#+END_SRC

#+RESULTS:
| FAVORITE | Mawile |

** Describing the location
So, we need a function that can describe a given location, easy
enough, as we simply need to fetch from the alist:
#+BEGIN_SRC lisp :tangle yes :exports code
(defun describe-location (location nodes)
  (cadr (assoc location nodes)))
#+END_SRC

#+RESULTS:
: DESCRIBE-LOCATION

We pass in =*nodes*= rather than access it directly in the function
because this is more in functional style... It lets us worry less
about the state of the program and more about the things we are
working with. (What is passed in.)

So:
#+BEGIN_SRC lisp :exports both
(describe-location 'living-room *nodes*)
#+END_SRC

#+RESULTS:
| YOU | ARE | IN | THE | LIVING-ROOM. | A | WIZARD | IS | SNORING | LOUDLY | ON | THE | COUCH. |

** Describing the edge/path
Of course, since we now have another alist, we should probably make a
function to describe a return from it as well. This will use a nifty
little thing known as "quasiquoting". This is a very key advantage to
working with a list rather than working with a string in this case,
as it lets us cleanly piece together a list that will describe the
information in "=*edges*=".

#+BEGIN_SRC lisp :tangle yes :exports code
(defun describe-path (edge)
  `(there is a ,(caddr edge) going ,(cadr edge) from here.))
#+END_SRC

#+RESULTS:
: DESCRIBE-PATH

The quasiquoting is simply the backquoted list and the commas used
inside. Pretty much, the backquote puts the code in data mode like a
single quote, except, you can un-quote for individual expressions and
replace them with the result for an individual list.

So:
#+BEGIN_SRC lisp :exports both
`(1 2 ,(+ 1 2))
#+END_SRC

#+RESULTS:
| 1 | 2 | 3 |

Because the src_lisp{(+ 1 2)} is replaced with its result. (=3=).

** Multiple path descriptions, apply and mapcar
Of course, unless our entire text adventure is only two rooms large (I
guess it's not a far-cry here) we will have multiple exits from some
rooms.

How would one elegantly return a list with all of the descriptions of
exits to a location? Since we have an alist that returns the symbol,
and then any number of edge lists that are adjacent to the location
the player is at, we can just =mapcar= the list without the first
element to the =describe-path= function!

We will want to append them all of the returned lists together, but
since the mapcar would return us potentially any number of lists, we
need to =apply= it to =append= rather than call it with the fixed
number of arguments in the code.

#+BEGIN_SRC lisp :tangle yes :exports code
(defun describe-paths (location edges)
  (apply #'append (mapcar #'describe-path (cdr (assoc location edges)))))
#+END_SRC

#+RESULTS:
: DESCRIBE-PATHS

The "#'" is just syntactic sugar that means to look for a function
with the name that follows.

Anyway, this function would look something like this:
#+BEGIN_SRC lisp :exports both
(describe-paths 'living-room *edges*)
#+END_SRC

#+RESULTS:
| THERE | IS | A | DOOR | GOING | WEST | FROM | HERE. | THERE | IS | A | LADDER | GOING | UPSTAIRS | FROM | HERE. |

** A limitation of apply
There is something that should be noted though, the =apply= function
can only accept so many operands... This amount can be retrieved by:
#+BEGIN_SRC lisp
call-arguments-limit
#+END_SRC

#+RESULTS:
: 4096

* Combining all of the above information into the magical "look"
Now that we have completed the above information-printing functions,
we can fetch the information all together with the current location
to make a parameterless =look= function that will describe the
players surrounding area.

Of course, we need a location in the first place, so we can do so by
defining another global variable, the "=*location*=" variable:

#+BEGIN_SRC lisp :tangle yes :exports code
(defparameter *location* 'living-room)
#+END_SRC

#+RESULTS:
: *LOCATION*

So, now that we have all the information we need to make a
non-functional function, we can create the look function:

#+BEGIN_SRC lisp :tangle yes :exports code
(defun look ()
  (append (describe-location *location* *nodes*)
          (describe-paths *location* *edges*)
          (describe-objects *location* *objects* *object-locations*)))
#+END_SRC

#+RESULTS:
: LOOK

This simply applies all of the information from the above code blocks
and returns a complete list with all of the information about the
environment surrounding the player.

So:
#+BEGIN_SRC lisp :exports both
(look)
#+END_SRC

#+RESULTS:
| YOU | ARE | IN | THE | LIVING-ROOM. | A | WIZARD | IS | SNORING | LOUDLY | ON | THE | COUCH. | THERE | IS | A | DOOR | GOING | WEST | FROM | HERE. | THERE | IS | A | LADDER | GOING | UPSTAIRS | FROM | HERE. | YOU | SEE | A | WHISKEY | ON | THE | FLOOR. | YOU | SEE | A | BUCKET | ON | THE | FLOOR. |

Neat, right?

** P - Print
Now, we need a print function that allows us to see the output from
our game in more than just uppercase.

This will require a few fancy rules and a =game-print= function... The
suggested code was as follows:

#+BEGIN_SRC lisp :tangle yes :exports code
(defun game-print (lst)
  (princ (coerce
          (tweak-text
           (coerce (string-trim "()" (prin1-to-string lst)) 'list) t nil)
          'string))
  (fresh-line))
#+END_SRC

#+RESULTS:
: GAME-PRINT

This function uses some new functions we haven't seen before and is
slightly more complicated than the rest of the code we have higher
above... Pretty much it just turns the list into a string using
=prin1-to-string=, removes the "=(=" and "=)=" that surround it with
=string-trim=, turns that string into a big list of characters with
=coerce=, and passes that to the =tweak-text= function (Not part of
Common Lisp, we will define it below) which then determines how to
capitalize the list of characters.

After that is all done, the list of characters is turned back into a
string with =coerce= and passed to =princ= to print it out in a
human-friendly form and a newline is inserted.

The =tweak-text= is a helper function defined and described below.

#+BEGIN_SRC lisp :tangle yes :exports code
(defun tweak-text (lst caps lit)
  (when lst
    (let ((item (car lst))
          (rest (cdr lst)))
      (cond ((eq item #\space)
             (cons item (tweak-text rest caps lit)))
            ((member item '(#\! #\? #\.))
             (cons item (tweak-text rest t lit)))
            ((eq item #\")
             (tweak-text rest caps (not lit)))
            (lit
             (cons item (tweak-text rest nil lit)))
            ((or caps lit)
             (cons (char-upcase item) (tweak-text rest nil lit)))
            (t (cons (char-downcase item) (tweak-text rest nil nil)))))))
#+END_SRC

#+RESULTS:
: TWEAK-TEXT

This pretty much goes through a list of characters, character by
character and tweaks it based on the status of the last character.

Essentially, it takes three arguments, a list of characters, whether
the current character should be capitalized, and whether or not we
are looking at an item that should be printed literally. (In quotes)

It uses a pattern where it will return the =cons= of the way the
current item should be printed with the =cdr= of calling itself with a
number of =cond= conditions to determine if the next character should
be capitalized, and changes the current character if needed. This
recursive pattern is called a "list-eater", which recursively calls
itself with the car of the list removed each iteration, passing
arguments to control the logic of the next iteration.

We have a condition in there for quotes because sometimes we will
want to print something in a list that will fail our usual formatting
shenanigans, or will have a character that is not valid for a Lisp
symbol...

Modifying our =game-print= function above to output a string and
passing in a list with quotes shows what the expected behaviour is:
#+BEGIN_SRC lisp :exports both :results output
  (game-print
   '(not only does this sentence have a "comma," it also mentions the "iPad."))
#+END_SRC

#+RESULTS:
: Not only does this sentence have a comma, it also mentions the iPad.

